package LessonsShcoolHeillel.Lesson9;
public class Main {
    public static void main(String[] args) {

        /*  1. Создать пустой проект в IntelliJ

            2. Создать класс "Сотрудник" с полями: ФИО, должность, email, телефон, возраст.

            3. Конструктор класса должен заполнять эти поля при создании объекта.
            Обеспечить инкапсуляцию внутренних свойств класса.

            4. Создать два класса с одинаковым именем SameName. (Использовать пакеты)

            5. Создать класс Car с публичным методом start. Метод start вызывает внутри себя методы:
	            - startElectricity()
	            - startCommand()
	            - startFuelSystem()
  Перечисленные методы, являются внутренней (скрытой) частью комплексного метода start.
  Они по сути отображают внутреннее поведение класса Car и не должны быть использованы за пределами данного класса.*/

    }
}
