package LessonsShcoolHeillel.Lesson12;

public class Main {
    public static void main(String[] args) {
        /*
        1. Создать пустой проект в IntelliJ

        2. Создайте классы: Человек, Кот, Робот.
        Данные классы не могут наследоваться от единого класса-родителя.
        (Участников много, подвидов много, контракт всегда един)

        3. Классы из п.3 должны обладать поведением бегать и прыгать.
        (методы просто выводят информацию о действии в консоль)

        3. Создайте классы: Беговая Дорожка и Стена.
        При прохождении через препятствия,
        участники должны выполнять соответствующие действия (бежать или прыгать).

        4. Создайте два массива: с участниками и препятствиями,
        и заставьте всех участников пройти этот набор препятствий.

         */
    }
}